app/views/shared/_header.html.erb

SELECT "categories".* FROM "categories"
---
      <ul class="nav-list list-inline">
        <% Category.all.each do |cat| %>

SELECT "authors".* FROM "authors"
---
      <ul class="nav-list list-inline container">
        <% Author.all.each do |author| %>