app/views/books/index.html.erb

      <ul>
        <% if Book.count > 0 %>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "books"