app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ?  ORDER BY "books"."id" ASC LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @book = Book.where(id: params[:id]).first

    @authors = @book.authors

    @categories = Category.all

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---
  def destroy
    Book.find_by(id: params[:id]).destroy