app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @category = Category.find_by(id: params[:id])